12/data/attachments/ab81d9f4ad9ccc34.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Pamela_first_Friend_89744_6</nif:username>
            <nif:friendToBeRequested>soap_friends_408bef4b-ea0f-4869-9202-5823b89f5637</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>